#+title: Eval Results

* v1.1-dspy-longbench-qwen4b-baseline  
:PROPERTIES:
:CREATED:  <2026-04-19 Sun> [18:15]
:END:

#+BEGIN_SRC bash :results output raw
cd ..; uv run python evaluate.py local_phoenix_config.yaml -o evals/evals_local_v11.json
#+END_SRC

#+RESULTS:
Fetched 1282 root spans, 620 CustomizableRLM.forward, 597 OK, 23 errors
Matched 577 unique predictions
Matched 577/750 examples

* v1.1-dspy-sft-train-data-longbench-qwen397b
:PROPERTIES:
:CREATED:  <2026-04-19 Sun> [18:16]
:END:

#+BEGIN_SRC bash :results output raw
cd ..; uv run python evaluate.py config_qwen397b.yaml -o evals/evals_qwen397b.json
#+END_SRC

#+RESULTS:
Fetched 597 root spans, 259 CustomizableRLM.forward, 238 OK, 21 errors
Matched 236 unique predictions
Matched 236/750 examples

